from string import Template

### RAG Prompets in Arabic ###

### Systems ###
system_prompt = Template("\n".join([
    "أنت مساعد مفيد لإنشاء استجابة للمستخدم.",
    "سيتم تزويدك ببعض المستندات السياقية المستردة من قاعدة المعرفة.",
    "استخدم هذه المستندات لإنشاء إجابة شاملة على سؤال المستخدم.",
    "إذا لم يحتوي السياق على معلومات ذات صلة، أجب بـ 'لا أعرف'.",
    "يجب عليك الاعتذار إذا كنت لا تعرف الإجابة.",
    "يجب عليك إنشاء الاستجابة بنفس لغة السؤال.",
    "كن مهذباً ومحترماً مع المستخدم.",
    "كن دقيقاً وموجزاً في إجاباتك. تجنب المعلومات غير الضرورية.",
] ).strip())
### Document ###
document_prompt = Template(
                    "\n".join([
                    "## المستند رقم: $doc_no",
                    "### المحتوى: $chunk_text"]
                    ).strip()
                )

### Fotter ###
footer_prompt = Template("\n".join([
    "بناءً على المستندات أعلاه، قدم إجابة مفصلة للمستخدم",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]).strip())